import numpy as np

def error_and_similarity(y_true, y_pred, eps=1e-6):
    y_true = np.asarray(y_true).reshape(-1)
    y_pred = np.asarray(y_pred).reshape(-1)

    # 오차
    error = y_pred - y_true

    # 예측 유사도 (%)
    similarity = (1 - np.abs(error) / (np.abs(y_true) + eps)) * 100
    

    # |error| : 절대 오차
    # |error| / |y_true| : 상대오차
    # 1 - 상대오차 : 얼마나 원값에 가까운가
    # × 100 : 퍼센트화
    # 👉 관측값(y_true)을 기준으로 예측값이 얼마나 벗어났는지를 %로 표현한 지표

    # 표시용 반올림 (계산값은 유지)
    error_round = np.round(error, 2)        # 셋째 자리 반올림
    similarity_round = np.round(similarity, 1)  # 둘째 자리 반올림

    return error_round, similarity_round


#------------------------------------------------------------------------------------------------
print('-------------------------------관심수위 궁내교--------------------------------')

# 1시간
# 관심수위 gn
y_true = [1.3, 2.31, 1.94, 1.67, 1.23, 1.24]
y_pred = [1.29112339, 2.45323371887207, 1.397294283, 1.264799953, 1.075569034, 1.23675215244293]

error, similarity = error_and_similarity(y_true, y_pred)

print("관심수위 1시간 오차:", error)
print("예측 유사도(%):", similarity)

print('-------------------------------관심수위 대곡교--------------------------------')

# 관심수위 dg
y_true = [2.33, 4.53, 2.06, 2.35, 1.91, 2.86]
y_pred = [2.332614183, 4.68784952163696, 2.011344194, 2.392430544, 1.889179945, 2.40825009346008]

error, similarity = error_and_similarity(y_true, y_pred)

print("관심수위 1시간 오차:", error)
print("예측 유사도(%):", similarity)

print('-------------------------------관심수위 궁내교--------------------------------')

# 3시간
# 관심수위 gn
y_true = [2.16, 2.51, 1.85, 1.36, 1.79, 1.57]
y_pred = [2.16877079, 2.70704722404479, 1.885674357, 1.361050725, 1.64096868, 1.5458984375]

error, similarity = error_and_similarity(y_true, y_pred)

print("관심수위 3시간 오차:", error)
print("예측 유사도(%):", similarity)

print('-------------------------------관심수위 대곡교--------------------------------')

# 관심수위 dg
y_true = [3.6, 4.87, 4.62, 2.91, 3.75, 2.97]
y_pred = [2.905599833, 5.06946372985839, 4.053395748, 2.537592411, 3.433107615, 3.24981617927551]

error, similarity = error_and_similarity(y_true, y_pred)

print("관심수위 3시간 오차:", error)
print("예측 유사도(%):", similarity)

#------------------------------------------------------------------------------------------------
print('-------------------------------20년수위 궁내교--------------------------------')

# 1시간
# 20년수위gn
y_true = [1.3, 2.31, 1.94, 1.67, 1.23, 1.24]
y_pred = [1.36598420143127, 2.53227973, 1.443492055, 1.458580375, 1.14335835, 1.31534934]

error, similarity = error_and_similarity(y_true, y_pred)

print("20년수위 1시간 오차:", error)
print("예측 유사도(%):", similarity)

print('-------------------------------20년수위 대곡교--------------------------------')

# 20년수위dg
y_true = [2.33, 4.53, 2.06, 2.35, 1.91, 2.86]
y_pred = [2.3688530921936, 4.819374561, 2.130158663, 2.363722801, 2.005535364, 2.55930686]

error, similarity = error_and_similarity(y_true, y_pred)

print("20년수위 1시간 오차:", error)
print("예측 유사도(%):", similarity)

print('-------------------------------20년수위 궁내교--------------------------------')

# 3시간
# 20년수위gn
y_true = [2.16, 2.51, 1.85, 1.36, 1.79, 1.57]
y_pred = [2.17101430892944, 2.936853647, 1.774380565, 1.347494721, 1.686939359, 1.654497743]

error, similarity = error_and_similarity(y_true, y_pred)

print("20년수위3시간 오차:", error)
print("예측 유사도(%):", similarity)

print('-------------------------------20년수위 대곡교--------------------------------')

# 20년수위dg
y_true = [3.6, 4.87, 4.62, 2.91, 3.75, 2.97]
y_pred = [2.92033267021179, 5.173332691, 3.796250343, 2.92291832, 3.17493248, 3.183192968]

error, similarity = error_and_similarity(y_true, y_pred)

print("20년수위 3시간 오차:", error)
print("예측 유사도(%):", similarity)

#------------------------------------------------------------------------------------------------
print('-------------------------------누적강우 궁내교--------------------------------')

# 1시간
# 누적강우gn
y_true = [1.3, 2.31, 1.94, 1.67, 1.23, 1.24]
y_pred = [1.300873637, 2.592343807, 1.322586298, 1.4725492, 1.132968783, 1.411407828]

error, similarity = error_and_similarity(y_true, y_pred)

print("누적강우 1시간 오차:", error)
print("예측 유사도(%):", similarity)

print('-------------------------------누적강우 대곡교--------------------------------')

# 누적강우dg
y_true = [2.33, 4.53, 2.06, 2.35, 1.91, 2.86]
y_pred = [2.381570578, 4.769173145, 2.067384481, 2.370943069, 1.979139805, 2.517552853]

error, similarity = error_and_similarity(y_true, y_pred)

print("누적강우 1시간 오차:", error)
print("예측 유사도(%):", similarity)

print('-------------------------------누적강우 궁내교--------------------------------')

# 3시간
# 누적강우gn
y_true = [2.16, 2.51, 1.85, 1.36, 1.79, 1.57]
y_pred = [2.080794811, 2.57658267, 1.741179466, 1.270294189, 1.516449571, 1.459784389]

error, similarity = error_and_similarity(y_true, y_pred)

print("누적강우 3시간 오차:", error)
print("예측 유사도(%):", similarity)

print('-------------------------------누적강우 대곡교--------------------------------')

# 누적강우dg
y_true = [3.6, 4.87, 4.62, 2.91, 3.75, 2.97]
y_pred = [3.080192566, 5.40976429, 3.995414019, 2.900321245, 3.463635921, 3.312577009]

error, similarity = error_and_similarity(y_true, y_pred)

print("누적강우 3시간 오차:", error)
print("예측 유사도(%):", similarity)